In [16]:
import pandas as pd

In [17]:
df = pd.read_csv('./table_11_9.csv')
df.head()

     j      q0       q1      q2       q3      q4      q5
0  0.1  0.0079  17.0400 -92.832  202.440 -209.38  82.726
1  0.2  0.1010   8.5465 -24.166   15.497     NaN     NaN
2  0.3  0.0861   8.2344 -22.274   13.963     NaN     NaN
3  0.4  0.0695   8.0297 -20.727   12.646     NaN     NaN
4  0.5  0.0533   7.8676 -19.357   11.457     NaN     NaN

In [10]:
## add a column with the name q4 and the value  209.38
df['q4'] = [-209.38, *[None for _ in range(df.shape[0]-1)]]

In [12]:
df['q5'] = [82.726, *[None for _ in range(df.shape[0]-1)]]

In [13]:
df.head()

     j      q0       q1      q2       q3      q4      q5
0  0.1  0.0079  17.0400 -92.832  202.440 -209.38  82.726
1  0.2  0.1010   8.5465 -24.166   15.497     NaN     NaN
2  0.3  0.0861   8.2344 -22.274   13.963     NaN     NaN
3  0.4  0.0695   8.0297 -20.727   12.646     NaN     NaN
4  0.5  0.0533   7.8676 -19.357   11.457     NaN     NaN

In [14]:
df.to_csv('./table_11_9.csv', index=False)